Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
keras_layer_2 (KerasLayer)   (None, 1280)              6931124   
_________________________________________________________________
dense_2 (Dense)              (None, 2)                 2562      
=================================================================
Total params: 6,933,686
Trainable params: 2,562
Non-trainable params: 6,931,124
_________________________________________________________________